# CLI tools
brew "git"
brew "ripgrep"
brew "fd"
brew "dockutil"
brew "mas"
brew "bitwarden-cli"
brew "gh"
brew "jq"
brew "croc"
brew "gnupg"
brew "homebrew/dupes/nano"

# CLI tools (casks)
tap "gussy/tap"
cask "gussy/tap/cmt"

# Terminal Setup
cask "ghostty"
cask "font-monaspace"
tap "jandedobbeleer/oh-my-posh"
cask "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "zoxide"
brew "fzf"

# GUI Applications
cask "visual-studio-code"
cask "gitbutler"
cask "claude"
cask "tailscale-app"
cask "windows-app"
cask "discord"
cask "autodesk-fusion"
cask "bambu-studio"
cask "utm"
cask "crystalfetch"
cask "obs"
cask "notion"
cask "chatgpt"
cask "affinity"
cask "lightburn"
#cask "kicad"
tap "5aaee9/kicad-nightly"
cask "kicad-nightly"
